#-*- coding:utf-8 -*-
# @Author : mingyu.ding
# @PROJECT: untitled
# @Time : 2020/9/17 9:26


# 一、大前提：
# 闭包函数 = 名称空间与作用域 + 函数嵌套 + 函数对象
# 核心点：名字的查找关系是以函数定义阶段为准

# 二、什么是闭包函数
# "闭"函数，指的是该函数是内嵌函数
# "包"函数，指的是该函数(f2)包含对外层函数(f1)作用域名字的引用（不是对全局作用域）

# 闭包函数之名称空间与作用域的应用 + 函数嵌套
# def f1():
#     x = 33333333333333333
#     def f2():
#         print(x)
#     f2()
#
# def bar():
#     x = 1111111111111
#     f1()
#
# def foo():
#     x = 22222222222222
#     bar()
#
# foo()

# 闭包函数：函数对象
# def f1():
#     x = 33333333333333
#     def f2():
#         print("函数f2:",x)
#     return f2 # 将f2地址放到全局使用
#
# f=f1()
#
# def foo():
#     x = 5555
#     f()
#
# foo()

# 三、为什么要有闭包函数，闭包函数的应用
# 两种为函数体传参的方式
# 方式一：直接把函数体需要的参数定义成形参
# def f2(x):
#     print(x)
# f2(1)
# f2(2)

# 方式2：
# def f1(x):
#     # x =3
#     def f2():
#         print(x)
#     return f2











